---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.ExtElemChangeBeamSectionRegistry
source: html/c6a64e0b-546d-1c37-b253-27839b87d1bd.htm
---
# ExtElemChangeBeamSectionRegistry Properties

Specifies whether the .NET object represents a valid Revit entity.